In [2]:
import pandas as pd
#외부 드라이브 설치 !pip install pandas

In [3]:
# 스리즈 형태의 데이터 생성
# pd.Series()

pd_list = pd.Series([5000,6000,6500,6500],
    index=["아메리카노",'카페라떼',"카페모카","카푸치노"])

In [5]:
print(pd_list)

아메리카노    5000
카페라떼     6000
카페모카     6500
카푸치노     6500
dtype: int64

In [39]:
# 스리즈 형태의 데이터에서 밸류의 값과 인덱스의 값을 따로 출력 가능
print("스리즈의 value = ", pd_list.values)
print("스리즈의 inndex = ", pd_list.index)

스리즈의 value =  [5000 6000 6500 6500]
스리즈의 inndex =  Index(['아메리카노', '카페라떼', '카페모카', '카푸치노'], dtype='object')

In [67]:
# 데이터프레임 형태의 데이터 생성

_value = [[1,2,3],[4,5,6],[7,8,9]]
_index = ["a","b","c"]
_column = ["A","B","C"]

pd_df = pd.DataFrame(_value,index=_index,columns=_column)

print(pd_df)

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [68]:
pd_df

   A  B  C
a  1  2  3
b  4  5  6
c  7  8  9

In [72]:
#데이터프레임의 value, index, column의 값을 출력

print("데이터 프레임의 value = ", pd_df.values)
print("데이터 프레임의 index = ", pd_df.index)
print("데이터 프레임의 column = ", pd_df.columns)

데이터 프레임의 value =  [[1 2 3]
 [4 5 6]
 [7 8 9]]
데이터 프레임의 index =  Index(['a', 'b', 'c'], dtype='object')
데이터 프레임의 column =  Index(['A', 'B', 'C'], dtype='object')

In [77]:
# 딕셔너리 형태의 데이터를 데이터프레임의 형태로 변경

_values = { "name":["A","B","C"], "age":[20,30,40], 
    "phone":["01021345645","01078945612","01045679612"]}



print(_values["name"])

['A', 'B', 'C']

In [76]:
pd_df2=pd.DataFrame(_values)
pd_df2

  name  age        phone
0    A   20  01021345645
1    B   30  01078945612
2    C   40  01045679612

In [29]:
# 상단의 행을 기준으로 출력하는 head(n)
# 상단부터 n번쨰까지 츨력하는 함수

pd_df2.head(2)

  name  age        phone
0    A   20  01021345645
1    B   30  01078945612

In [30]:
# 하단부터 n번째까지 출력하는 함수 tail(n)

pd_df2.tail(2)

  name  age        phone
1    B   30  01078945612
2    C   40  01045679612

In [75]:
# 컬럼을 기준으로 출력

pd_df2[['age','phone']]

   age        phone
0   20  01021345645
1   30  01078945612
2   40  01045679612

In [34]:
# pandas를 이용해서 외부 파일을 로드
# csv파일을 로드 >> read.csv("파일명")

df = pd.read_csv("example.csv")
df

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [40]:
# 경로지정 
# 1. 절대 경로 
    # - 절대적인 주소
    # - ex) c:/user/administrator/a.txt, 인터넷 ur
# 2. 상대 경로
#   - 상대적인 주소
#   - ex) './' >> 현재 작업중인 폴더
#   - '../' >> 상위폴더로 이동 
#   - './폴더명' >> 하위폴더로 이동
#   - '../폴더명' >> 상위폴더로 이동 후 하위폴더로 이동

In [52]:
# 상위폴더에 있는  ../
# csv 폴더로 이동해서 /csv
#  example.csv 파일을 pandas를 이용해서 로드

df1 = pd.read_csv("../csv/example.csv")
df1

  Name  Gender          Phone
0    A    male  010-1234-5678
1    B  female  010-1234-5679
2    C    male  010-1234-5680
3    D  female  010-1234-5681
4    E    male  010-1234-5682
5    F  female  010-1234-5683
6    G    male  010-1234-5684
7    H  female  010-1234-5685
8    I    male  010-1234-5686
9    J  female  010-1234-5687

In [78]:
# 상위폴더로 이동해서 csv 폴더의 num_2 폴더 안에 있는 drinks.csv 파일 로드

df3 = pd.read_csv("../csv/num_2/drinks.csv")
df3
df3.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF